<?php
// Heading
$_['heading_title']        = 'Управление ценами';
$_['local_title']          = 'Управление ценами';

// Column
$_['column_title']         = 'Название';
$_['column_action']        = 'Действие';

// Entry
$_['entry_date_start']     = 'Дата начала:';
$_['entry_date_end']       = 'Дата окончания:';
$_['entry_group']          = 'Группа покупателей:';
$_['entry_model']          = 'Модель:';
$_['entry_sku']            = 'Артикул:';
$_['entry_quantity']       = 'Количество:';
$_['entry_option']         = 'Применить эти изменения также к опциям:';
$_['entry_round']          = 'Округление:';
$_['entry_price']          = 'Цена товара ';
$_['entry_base_price']     = 'Базовая цена товара ';
$_['entry_option_price']     = 'Цена опиций товара ';
$_['entry_min_price']      = 'от';
$_['entry_max_price']      = 'до';
$_['entry_key']            = 'Введите лицензионный ключ:';

$_['button_close']         = 'Завершить';
$_['button_save_1']        = 'Изменить цены товаров';
$_['button_save_2']        = 'Изменить базовые цены товаров';
$_['button_save_3']        = 'Изменить цены опций';
$_['button_save_4']        = 'Изменить базовые цены опций';
$_['button_save_5']        = 'Добавить спец. предложения';
$_['button_save_6']        = 'Добавить спец. предложения для товаров с базовой ценой больше нуля';
$_['button_save_7']        = 'Добавить скидки';
$_['button_save_8']        = 'Добавить скидки для товаров с базовой ценой больше нуля';
$_['button_save_9']        = 'Изменить специальные предложения в опциях';
$_['button_save_30']       = 'Изменить цены в связанных опциях';
$_['button_save_31']       = 'Изменить скидки в связанных опциях';
$_['button_save_32']       = 'Изменить спец. предложения в связанных опциях';

$_['tab_price']           = 'Цены';
$_['tab_option']          = 'Опции';
$_['tab_special']         = 'Специальные предложения';
$_['tab_discount']        = 'Скидки';
$_['tab_log']             = 'История изменений';
$_['tab_license']         = 'Лицензия';

// Text
$_['text_category']       = 'Категории';
$_['text_manufacturer']   = 'Производители';

$_['text_price']          = 'Изменение цен в товарах';
$_['text_option']         = 'Изменение цен в опциях';
$_['text_extra_charge']   = 'Изменение процентной наценки в товарах';
$_['text_base_price']     = 'Изменение базовых цен в товарах';
$_['text_base_option']    = 'Изменение базовых цен в опциях';
$_['text_base_currency_code'] = 'Задание базовой валюты в товарах';

$_['text_special']        = 'Завершение акций';
$_['text_delete_special'] = 'Удаление закончившихся акций';
$_['text_special_add']    = 'Добавление акций';
$_['text_special_base_add'] = 'Добавление акций для товаров с базовой ценой больше нуля';
$_['text_special_add_notes'] = 'Все действующие акции для выбранных товаров будут закрыты текущей датой.';

$_['text_discount']        = 'Завершение скидок';
$_['text_delete_discount'] = 'Удаление закончившихся скидок';
$_['text_discount_add']    = 'Добавление скидок';
$_['text_discount_base_add'] = 'Добавление скидок для товаров с базовой ценой больше нуля';
$_['text_discount_add_notes'] = 'Все действующие скидки для выбранных товаров будут закрыты текущей датой.';

$_['text_group']          = 'Группы товаров';
$_['text_noround']        = 'Не округлять';
$_['text_digit99']        = 'Округлить до .99';
$_['text_digitx9']        = 'Округлить до .x9';
$_['text_digit01']        = 'Округлить до десятых';
$_['text_digit001']       = 'Округлить до сотых';
$_['text_digit1']         = 'Округлить до целого числа';
$_['text_digit1_plus']    = 'Округлить до целого числа в большую сторону';
$_['text_digit5']         = 'Округлить до 5';
$_['text_digit9']         = 'Округлить до 9';
$_['text_digit10']        = 'Округлить до 10';
$_['text_digit50']        = 'Округлить до 50';
$_['text_digit90']        = 'Округлить до 90';
$_['text_digit199']       = 'Округлить до 99';
$_['text_digit100']       = 'Округлить до 100';
$_['text_digit500']       = 'Округлить до 500';
$_['text_digit1000']      = 'Округлить до 1000';
$_['text_digit10000']     = 'Округлить до 10000';
$_['text_digit100000']    = 'Округлить до 100000';
$_['text_option_name']    = '--- Опция не выбрана ---';
$_['text_option_value_name'] = '--- Значение опции не выбрано ---';
$_['text_edit']              = 'Изменение цен, опций, акций и скидок в товарах';
$_['text_separator']         = ' &gt; ';
$_['text_round_default']  = 'стандартно';
$_['text_round_ceil']     = 'в большую сторону';
$_['text_round_floor']    = 'в меньшую сторону';


$_['text_success_license']           = 'Модуль успешно активирован!';
$_['text_success_price']             = 'Цены для выбранных товаров были успешно изменены.';
$_['text_success_option']            = 'Цены в опциях для выбранных товаров были успешно изменены.';
$_['text_success_option_special_price'] = 'Специальные предложения в опциях для выбранных товаров были успешно изменены.';
$_['text_success_special_add']       = 'Акции для выбранных товаров были успешно добавлены.';
$_['text_success_special']           = 'Акции для выбранных товаров были успешно изменены.';
$_['text_success_delete_special']    = 'Акции для выбранных товаров были успешно удалены.';
$_['text_success_discount_add']      = 'Скидки для выбранных товаров были успешно добавлены.';
$_['text_success_discount']          = 'Скидки для выбранных товаров были успешно изменены.';
$_['text_success_delete_discount']   = 'Скидки для выбранных товаров были успешно удалены.';
$_['text_success_base_price']        = 'Базовые цены для выбранных товаров были успешно изменены.';
$_['text_success_base_option']       = 'Базовые цены в опциях для выбранных товаров были успешно изменены.';
$_['text_success_special_base_add']  = 'Акции для выбранных товаров с базовыми ценами были успешно добавлены.';
$_['text_success_discount_base_add']  = 'Скидки для выбранных товаров с базовыми ценами были успешно добавлены.';
$_['text_success_extra_charge']      = 'Процентная наценка для выбранных товаров была успешно изменена.';
$_['text_success_base_currency_code'] = 'Базовая валюта для выбранных товаров была успешно изменена.';
$_['text_success_clear_log']         = 'История изменений была очищена.';
$_['text_license']        = 'Лицензия';
$_['text_notice']         = 'Для получения лицензионного ключа отправьте на адрес <a href="mailto:louise@yandex.ru">louise@yandex.ru</a> письмо со следующим содержанием:
                            <ol>
                                <li>Адрес сайта, где вы купили модуль.</li>
                                <li>Ваш логин, который вы использовали при покупке.</li>
                                <li>Дату покупки.</li>
                                <li>Ваш домен, для которого вы хотите активировать модуль.</li>
                            </ol>

                            В теме письма укажите: Получение лицензии на модуль "Управление ценами".<br/><br/>
                            <strong>Если Вы уже получали ключ для более ранних версий модуля, то получить новый ключ вы можете пройдя по следующей <a href="http://www.opencartplus.ru/getnewkey.php?module=price" target="_blank">ссылке</a>.</strong>';


// Error
$_['error_permission']     = 'У Вас нет прав для изменения этого модуля!';
$_['error_log_size']       = 'Внимание: Ваш лог весит %s МБ. Максимальнй разрешенный размер - 6 МБ.';
$_['error_file_get_contents']     = '<p>Вам необходимо включить на сервере работу функции file_get_contents. Без нее модуль работать не будет.</p>
            <p>Для этого в php.ini есть опция allow_url_fopen - ее сделайте On.</p>
            <p>Если доступа к php.ini нет, 
            попробуйте создать файлик .htaccess в корне сайта и прописать там: 
            php_flag allow_url_fopen 1</p>
            Если это не помогло, пишите в тех. поддержку хостинга и просите включить работу этой функции - она может быть отключена выше.</p>';
$_['error_title']     = 'Ошибка! Нужно донастроить хостинг.';
$_['error_title_lib']     = 'Ошибка! Нужно донастроить библиотеку для модуля.';
$_['error_louise170'] = '<p>Вы не подключили библиотеку необходимую для работы модуля.</p>
            <p>Смотрите файл readme.txt из архива модуля и выполняйте пункт 3.</p>';
$_['error_license']     = 'Необходимо активировать модуль! Введите лицензионный ключ на главной странице модуля во вкладке "Лицензия".';
$_['error_license2']    = 'Введите правильный ключ. Введенный вами ключ не подходит!';
